SantiniAmedeoVentiEdoardo/reactingFlows/combustor2D_RF/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.767
0.767
0.767
0.767
0.767
0.767
0.767
0.767
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.767;
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            zeroGradient;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    back
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
