SantiniAmedeoVentiEdoardo/reactingFlows/combustor2D_RF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15677
(
(-0.397188 6.49098 0)
(0.585582 9.38642 0)
(-0.0510347 3.66978 0)
(0.0880076 9.91275 0)
(0.189221 7.65747 0)
(0.00135539 3.09344 0)
(0.288055 10.0291 0)
(0.118016 9.41429 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 10 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            noSlip;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 15 0);
    }
    back
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
