SantiniAmedeoVentiEdoardo/reactingFlows/combustor2D_RF/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.138134
0.459816
0.199193
0.409408
1.29001
0.392054
0.384544
0.676788
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    fuel_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
