SantiniAmedeoVentiEdoardo/reactingFlows/combustor2D_RF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother	GaussSeidel;
	tolerance       1e-05;
        relTol          0.01;
    }

    pFinal
    {
	    $p;
	    reltol	0;
    }

    "(rho|U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    "(rho|U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

   "h.*"
   {
	$U;
	tolerance	1e-6;
	relTol		0;
   }
   "(Yi|O2|N2|H2O).*"
   {
	   solver 		PBiCGStab;
	   preconditioner 	DILU;
	   tolerance 		1e-6;
	   relTol 		0;
   }

		
}

PIMPLE
{
	nCorrectors			1;
	nOuterCorrectors		30; 
	turbOnFinalIterOnly		no;
	nNonOrthogonalCorrectors	0;
	consistent			yes;

	outerCorrectorResidualControl
	{
		"(U|k|epsilon|p|h)"
		{
			relTol		0;
			tolerance	1e-5;
		}
	}
}


relaxationFactors
{
	fields
	{
		"p.*"			0.6;
		"rho.*"			0.5;
	}

	equations
       	{
        	"U.*"               	0.5;
       		"(k|epsilon).*"         0.5;
		"(h|e)"			0.5;
    	}
}


// ************************************************************************* //
